Classes | Public Member Functions | Friends | List of all members
ACAPI::MEP::VentilationPortDefault Class Referencefinal
MEP Element Manager
Through this VentilationPortDefault you can access and configure the VentilationPorts of MEPElementDefaults before placement. More...
#include <MEPVentilationPortDefault.hpp>
 Inheritance diagram for ACAPI::MEP::VentilationPortDefault:
 Classes
class  | Modifier
Modifier of the VentilationPortDefault. More...
 Public Member Functions
double  | GetHeight () const
double  | GetWallThickness () const
FlowDirection  | GetFlowDirection () const
template<class ModifierFunc >
Result< void >  | Modify (ModifierFunc &&modifierFunc)
Executes the given modifier scope in a NotUndoable command.
 Public Member Functions inherited from ACAPI::MEP::PortDefaultBase
GS::UniString  | GetName () const
double  | GetWidth () const
ConnectorShape  | GetShape () const
API_AttributeIndex  | GetMEPSystem () const
Domain  | GetDomain () const
template<class ModifierFunc >
Result< void >  | Modify (ModifierFunc &&modifierFunc)
Executes the given modifier scope in a NotUndoable command.
 Public Member Functions inherited from ACAPI::Object
Object (std::shared_ptr< Impl::ObjectImpl > impl)
Constructs a new object.
const API_Token &  | GetToken () const
Get the token for this object.
 Friends
 class  | ACAPI::Impl::ObjectCreator
 Additional Inherited Members
 Protected Member Functions inherited from ACAPI::MEP::PortDefaultBase
PortDefaultBase (std::shared_ptr< Impl::IPortDefaultBaseImpl > impl)
Constructs a PortBase with the given PortDefaultBase implementation.
 Protected Member Functions inherited from ACAPI::Object
~Object ()
Default destructor.
 Protected Attributes inherited from ACAPI::Object
 std::shared_ptr< Impl::ObjectImpl >  | mImpl
Impl object given by constructor.
Detailed Description
Through this VentilationPortDefault you can access and configure the VentilationPorts of MEPElementDefaults before placement.
Since
Archicad 28
Example code snippet from Test / New MEP
Take a look at PortDefaultBase
Member Function Documentation
◆ GetFlowDirection()
 FlowDirection ACAPI::MEP::VentilationPortDefault::GetFlowDirection  |  ( |   | ) |   const
Returns
Returns the flow direction of the VentilationPort.
◆ GetHeight()
 double ACAPI::MEP::VentilationPortDefault::GetHeight  |  ( |   | ) |   const
Returns
Returns the height of the VentilationPort.
◆ GetWallThickness()
 double ACAPI::MEP::VentilationPortDefault::GetWallThickness  |  ( |   | ) |   const
Returns
Returns the wall thickness of the VentilationPort.
◆ Modify()
 template<typename ModifierFunc >
 Result< void > ACAPI::MEP::VentilationPortDefault::Modify  |  ( |  ModifierFunc && |  modifierFunc | )
Executes the given modifier scope in a NotUndoable command.
Parameters
modifierFunc | The modifier scope (lambda, std::function or function pointer) the caller wants to execute.
Returns
Returns an error if the process of modification fails for some reason, otherwise nothing.